{
  "locations": [
    {
      "id": "town_square",
      "name": "Alcia Town Square",
      "description": "The vibrant heart of Alcia, where cobblestone paths wind between colorful merchant stalls and where travelers exchange tales by the ancient fountain. The distant sound of a blacksmith's hammer rings through the air, and town criers announce the latest news about monster sightings in the surrounding wilderness.",
      "actions": [
        {
          "id": "search_for_monsters",
          "name": "Hunt in the Wilds",
          "description": "Venture beyond the town walls to track and hunt dangerous creatures that threaten Alcia's safety. Rewards await those brave enough to face these beasts.",
          "results": {
            "trigger_encounter": true
          }
        },
        {
          "id": "visit_blacksmith",
          "name": "Visit Master Blacksmith",
          "description": "Seek the expertise of Dorn, the renowned weaponsmith whose creations are sought after throughout the realm. His forge offers weapons of exceptional quality, upgrades for your existing gear, and fair prices for adventurers looking to sell their spoils.",
          "results": {
            "location_change": "blacksmith_shop"
          }
        }
      ]
    },
    {
      "id": "blacksmith_shop",
      "name": "Dorn's Legendary Forge",
      "description": "The scorching heat of the forge greets you as you enter. The air shimmers with embers and the rhythmic clanging of hammer on anvil echoes through the workshop. Weapons of all varieties line the walls, from simple daggers to ornate swords etched with ancient runes. Dorn, a mountain of a man with arms like tree trunks, nods in acknowledgment of your arrival.",
      "actions": [
        {
          "id": "buy_weapon",
          "name": "Browse Weaponry",
          "description": "Examine Dorn's impressive selection of finely crafted weapons, from razor-sharp daggers to massive two-handed greatswords. Each weapon is meticulously forged for perfect balance and deadly precision.",
          "results": {
            "open_menu": "buy_weapons"
          }
        },
        {
          "id": "sell_weapon",
          "name": "Trade Your Arms",
          "description": "Present your surplus weapons to Dorn for appraisal. His expert eye evaluates craftsmanship and materials, offering fair prices for quality arms that he can refurbish and resell.",
          "results": {
            "open_menu": "sell_weapons"
          }
        },
        {
          "id": "upgrade_equipment",
          "name": "Enhance Your Gear",
          "description": "Commission Dorn to improve your existing equipment using rare materials gathered from your adventures. His masterful techniques can strengthen, sharpen, and imbue your gear with special properties.",
          "requirements": {
            "has_equipment": true,
            "has_materials": true
          },
          "results": {
            "open_menu": "upgrade_menu"
          }
        },
        {
          "id": "return_to_town",
          "name": "Return to Town Square",
          "description": "Bid farewell to Dorn and head back to the bustling activity of Alcia's town square, where other opportunities and adventures await.",
          "requirements": {},
          "results": {
            "location_change": "town_square"
          }
        }
      ]
    }
  ]
}
